# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11n-ELA: YOLO11n with Efficient Local Attention (CVPR 2024) in the neck
# Paper: https://arxiv.org/abs/2403.01123

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  n: [0.50, 0.25, 1024] # summary: 322 layers, ~2,700,000 parameters, ~7.0 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 322 layers, ~9,800,000 parameters, ~22.5 GFLOPs
  m: [0.50, 1.00, 512] # summary: 412 layers, ~20,700,000 parameters, ~70.0 GFLOPs
  l: [1.00, 1.00, 512] # summary: 634 layers, ~26,100,000 parameters, ~90.0 GFLOPs
  x: [1.00, 1.50, 512] # summary: 634 layers, ~58,600,000 parameters, ~200.0 GFLOPs

# YOLO11n backbone (unchanged)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n-ELA head (ELA after each feature fusion in the neck)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, ELA, []] # 13 ELA-A (neck P4 fusion)
  - [-1, 2, C3k2, [512, False]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, ELA, []] # 17 ELA-B (neck P3 fusion)
  - [-1, 2, C3k2, [256, False]] # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P4
  - [-1, 1, ELA, []] # 21 ELA-C (head P4 fusion)
  - [-1, 2, C3k2, [512, False]] # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 25 (P5/32-large)

  - [[18, 22, 25], 1, Detect, [nc]] # Detect(P3, P4, P5)
